/**
 * Op.java
 * 调用系统的Robot类，实现一些操作，如：
 * 这里以填充Excel为例，将hero数组中的数据填充到Excel中。
 */
public class Op extends TP{
    public static void main(String[] args) {
        System.out.println("Hello world!");
        Op ok = new Op();
        // ok.doWork();
        ok.fillExcel();

        //ok.screenShot(300,400,800,600,"/home/sc/图片/1.png");
        //ok.writeTxt("/home/sc/文档/0.txt", "次日九点钟的光景，老残赶忙吃了饭，走到明湖居，才不过十点钟。那明湖居本是个大戏园子，戏台前有一百多张桌子。哪知进了园门，园子里面已经坐得满满的了，只有中间七八张桌子还无人坐，桌子却都贴着 “抚院定”“学院定” 等类红纸条儿。老残看了半天，无处落脚，只好袖子里送了看坐儿的二百个钱，才弄了一张短板凳，在人缝里坐下。看那戏台上，只摆了一张半桌，桌子上放了一面板鼓，鼓上放了两个铁片儿，心里知道这就是所谓梨花简了，旁边放了一个三弦子，半桌后面放了两张椅子，并无一个人在台上。偌大的个戏台，空空洞洞，别无他物，看了不觉有些好笑。园子里面，顶着篮子卖烧饼油条的有一二十个，都是为那不吃饭来的人买了充饥的。\n" + //
                        // "\n" + //
                        // "到了十一点钟，只见门口轿子渐渐拥挤，许多官员都着了便衣，带着家人，陆续进来。不到十二点钟，前面几张空桌俱已满了，不断还有人来，看坐儿的也只是搬张短凳，在夹缝中安插。这一群人来了，彼此招呼，有打千儿的，有作揖的，大半打千儿的多。高谈阔论，说笑自如。这十几张桌子外，看来都是做生意的人，又有些像是本地读书人的样子，大家都嘁嘁喳喳的在那里说闲话。因为人太多了，所以说的什么话都听不清楚，也不去管他。\n" + //
                        // "\n" + //
                        // "到了十二点半钟，看那台上，从后台帘子里面，出来一个男人，穿了一件蓝布长衫，长长的脸儿，一脸疙瘩，仿佛风干福橘皮似的，甚为丑陋。但觉得那人气味倒还沉静，出得台来，并无一语，就往半桌后面左手一张椅子上坐下，慢慢的将三弦子取来，随便和了和弦，弹了一两个小调，人也不甚留神去听。后来弹了一枝大调，也不知道叫什么牌子；只是到后来，全用轮指，那抑扬顿挫，入耳动心，恍若有几十根弦，几百个指头，在那里弹似的。这时台下叫好的声音不绝于耳，却也压不下那弦子去。这曲弹罢，就歇了手，旁边有人送上茶来。");
    }

    void doWork(){
        delay(2500);
        int i=0;
        while (i<20) {
            if(i>=0&&i<5)
                right();
            else if(i>=5&&i<10)
                left();
            else if(i>=10&&i<15)
                down();
            else
                up();
            delay(250);
            i++;
        }
    }

    // 填充Excel，当程序运行起来后，需要在2.5秒以内，将鼠标移动到Excel的左上角，就开始自动填充Excel了
    void fillExcel(){
        delay(2500);

        final int r = hero.length;
        final int c = 3;
        for (int i = 0; i < r; i++) {
            for (int j = 0; j < c; j++) {
                copy(hero[i][j]);
                ctrlV();
                delay(300);
                right();
                delay(50);
            }
            enter();
            delay(100);
            for (int k = 0; k < c; k++) {
                left();
                delay(50);
            }
        }
    }

    String[][] hero = {
        {"阳顶天","教主","48岁"},
    {"光明左使","杨逍","40岁"},
    {"光明右使","范遥","40岁"},
    {"紫衫龙王", "黛绮丝", "30岁"},
    {"白眉鹰王", "殷天正", "40岁"},
    {"金毛狮王", "谢逊", "40岁"},
    {"青翼蝠王", "韦一笑", "40岁"},
    {"布袋和尚", "说不得", "38岁"},
    {"铁冠道人", "张中", "39岁"},
    {"冷面先生", "冷谦", "38岁"},
    {"彭和尚", "彭莹玉", "39岁"},
    {"周颠", "周颠", "40岁"},
    {"及时雨","宋江","39 岁"},
    {"玉麒麟","卢俊义","33 岁"},
    {"智多星","吴用","34 岁"},
    {"入云龙","公孙胜","32 岁"},
    {"大刀","关胜","35 岁"},
    {"豹子头","林冲","36 岁"},
    {"霹雳火","秦明","34 岁"},
    {"双鞭","呼延灼","37 岁"},
    {"小李广","花荣","30 岁"},
    {"小旋风","柴进","38 岁"},
    {"扑天雕","李应","35 岁"},
    {"美髯公","朱仝","33 岁"},
    {"花和尚","鲁智深","37 岁"},
    {"行者","武松","32 岁"},
    {"双枪将","董平","31 岁"},
    {"没羽箭","张清","30 岁"},
    {"青面兽","杨志","33 岁"},
    {"金枪手","徐宁","32 岁"},
    {"急先锋","索超","34 岁"},
    {"神行太保","戴宗","33 岁"},
    {"赤发鬼","刘唐","31 岁"},
    {"黑旋风","李逵","30 岁"},
    {"九纹龙","史进","32 岁"},
    {"没遮拦","穆弘","33 岁"},
    {"插翅虎","雷横","34 岁"},
    {"混江龙","李俊","33 岁"},
    {"立地太岁","阮小二","35 岁"},
    {"船火儿","张横","34 岁"},
    {"短命二郎","阮小五","33 岁"},
    {"浪里白条","张顺","32 岁"},
    {"活阎罗","阮小七","31 岁"},
    {"病关索","杨雄","33 岁"},
    {"拼命三郎","石秀","32 岁"},
    {"两头蛇","解珍","31 岁"},
    {"双尾蝎","解宝","30 岁"}};
}
